#Область ПрограммныйИнтерфейс

// Возвращает сумму заказа без НДС.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказКлиента - заказ.
//
// Возвращаемое значение:
//  Число - сумма без НДС.
//
Функция СуммаЗаказаБезНДС(Заказ) Экспорт

	Возврат Заказ.Товары.Итог("Сумма") - Заказ.Товары.Итог("СуммаНДС");

КонецФункции

// Возвращает сумму заказа с НДС.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказКлиента - заказ.
//
// Возвращаемое значение:
//  Число - сумма с НДС.
//
Функция СуммаЗаказаСНДС(Заказ) Экспорт

	СумаНДС = Заказ.Товары.Итог("СуммаНДС");
	Возврат СуммаЗаказаБезНДС(Заказ) + СумаНДС;

КонецФункции

#КонецОбласти
