#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Готовит таблицы движений документа для проведения.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.РеализацияТоваровУслуг - проводимый документ.
//  ДополнительныеСвойства - Структура - дополнительные свойства проведения.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса);
	ПроведениеСервер.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса)

	ИмяРегистра = "ТоварыНаСкладах";
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Реализация.Дата КАК Период,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	Реализация.Склад КАК Склад,
	|	СУММА(ТаблицаТовары.Количество) КАК ВНаличии
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО ТаблицаТовары.Ссылка = Реализация.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Реализация.Дата,
	|	ТаблицаТовары.Номенклатура,
	|	Реализация.Склад";
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
